const H1Style = {
  fontSize: 24,
  fontWeight: 'bold',
  color: '#555555'
};

const pStyle ={
  fontSize: 15,
  color: '#7c7c7e',
};

const divStyle = {
  fontSize: 16,
  color: '#87b3c9'
};

export default () => {
  return (
    <div style={{ height: 1060, padding: '0 480px', margin: '40px 0' , overflowY: 'auto' }}>
      <h1 style={H1Style}>使用条款</h1>
      <p style={pStyle}>
        （“您”）和U4SKY之间有关您使用本网站的具有法律约束力的协议。
        “您”是指受这些使用条款（“条款”）约束的实体，无论是否年满18岁的自然人，还是公司实体。
        这些条款可能会被翻译成其它语言，但如果中文和外文翻译有任何矛盾，在中国区都将适用于本站中文语言条款。
      </p>
      <div style={divStyle}>
        <p>Ⅰ：定义</p>
        <p>Ⅱ：一般使用</p>
        <p>Ⅲ：保证</p>
        <p>Ⅳ：责任限制</p>
        <p>Ⅴ：终止和一般条款</p>
      </div>
      <h1 style={H1Style}>Ⅰ：定义</h1>
      <div style={pStyle}>
        <p>“U4SKY”包括U4Sky优图必品牌，以及代表U4Sky优图必分销网站媒体产品的所有许可的关联公司和合作伙伴。</p>
        <p>
          “ 网站交易产品“是指一个或多个数字文件、图像或视频的统称，它们以产品标识的形式展示在网站上，
          具有对应的产品ID标识码；可由您或者其他U4SKY注册用户上传在网站上交易。
          一个网站交易产品可能包括3D模型，纹理贴图，运动截图，照片，图像，应用程序和插件软件，材料和着色器，
          形状和矢量图形，培训材料，构建组件，音效，音乐和视频。此外，网站交易产品可能包含多个不同文件格式的单独文件，
          以便客户更容易在各种软件应用程序（如3ds Max，Maya和Cinema 4D）中工作，还可能包含其他文件（如用于纹理的jpeg图像），
          以及用于促销目的的图像或其他文件。对于客户及其在创作中的使用，此定义还包括用于此目的的衍生和中间文件。
        </p>
        <p>
          “站点”是指u4sky.com网站，API，软件应用程序或目前存在或将来的任何已批准的手段或实用程序;
          U4SKY用于提供此类服务的软件和源代码; 用户界面布局，设计，图像，文本，知识库文章，程序提供;
          报告中提供的网站信息（如流行的关键词搜索）; 以及受版权，商标，专利，宣传或任何其他所有权保护的所有其他知识产权。
        </p>
        <p>为了使阅读本协议更容易，重复性更低，使用以下构造：</p>
        <p>“包括”、“包括等”、“如”被视为遵循“但不限于”。本协议中所用的例子是为了说明，而不是限制术语的范围。</p>
        <p>“以下限制”、“上述限制”和“受限制”视为“除了本协议中适用的所有其他限制外”。</p>
      </div>
      <h1 style={H1Style}>Ⅱ：一般使用</h1>
      <div style={pStyle}>
        <p>1. 本网站的一般许可。</p>
        <p>a. 所有权：除了在这些条款中明确授权给您，以及其他协议中由U4SKY提供给您的网站交易产品，其作者保留所有权和相关利益。</p>
        <p>
          b. 未经授权使用。如果您以未经授权的方式使用本网站或网站交易产品，U4SKY可能会终止您的帐户，
          并根据本协议或相关法律追诉您的责任及损害赔偿。该网站的下列用途被明确禁止：
        </p>
        <p>Ⅰ. 除了明确授权许可给您之外的，以商业用途为目的使用在线链接、框架、伪造标题、URL或以其他方式重新包装本网站;</p>
        <p>Ⅱ. 从网站或网站交易产品中掩盖、屏蔽、删除相关水印、版权或其他专有通知；</p>
        <p>
          III. 挖掘、黑客攻击、探测、蜘蛛、爬虫或刮取站点或网站交易产品，或类似地收集或提取数据（无论是手动还是机器人），
          包括通过索引、缓存或聚合;
        </p>
        <p>IV. 进行反编译，逆向工程或制作衍生作品;</p>
        <p>Ⅴ. 干扰（或从事任何可能干扰的活动）影响用户的使用;</p>
        <p>Ⅵ. 探测技术漏洞，或规避任何安全措施或访问限制;</p>
        <p>Ⅶ. 利用本网站进行招聘或出于任何理由对U4SKY艺术家进行骚扰;</p>
        <p>
          Ⅷ. 与任何人共享与本网站相关的任何私人或半私人信息，除非您得到发送方的许可。
          举例来说，您不能把私人讯息或半私人讯息的方式发送给您的信息，公开或与任何第三方分享。
        </p>
        <p>
          b. 由您提交的材料。U4SKY对您在使用本网站时提交的任何材料，不要求提出任何所有权或责任方面的材料。
          本节为您向U4SKY发布或者购买评论网站交易产品（“论坛”）时提交或发布的任何文字、图像或数据产品设置附加规则。
        </p>
        <p>a. U4SKY欢迎建设性的批评或者建议。但是，您需要保持在专业3D或相关主题的建设性及专业性的基础之上。</p>
        <p>b. 未经本人同意，您不得提交任何透露、储存或收集任何联系信息及附带任何个人信息的资料。</p>
        <p> c. 您不得以任何方式发布任何辱骂、骚扰、威胁、有害、不准确的、诽谤、中伤、淫秽色情，种族主义，或淫秽的言论。</p>
        <p>d. 您不可以发布其他产品或服务的垃圾邮件或广告；您不可以从多个帐户发布破坏、煽动或偏离主题的评论。</p>
        <p>e. 您对您在本网站的发布过程以及您所发布的产品内容，以及您在本网站对其他产品发布的评论，均对此负全部责任。</p>
        <p>
          f. 您不得发布或连结任何包含软件病毒或其他计算机代码、文件或程序以阻止干扰、破坏或限制任何计算机软件、硬件或通讯
          设备功能的文件及程序。
        </p>
        <p>g. 您不得发布或链接任何侵犯任何第三方权利或违反任何法律、规则或法规的内容。</p>
        <p>h. 您不能重新发布需要访问站点用户帐户的其他信息，如私人信息或数据报告。</p>
      </div>
      <h1 style={H1Style}>III.保证</h1>
      <div style={pStyle}>
        <p>您对U4SKY承诺并保证：</p>
        <p>1.您有充分的权利、权力、法律行为能力，以及签署并执行本协议的能力，已经获得了任何必要的第三方同意，
          并在任何购买之前，都有机会寻求独立的法律顾问。
        </p>
        <p>2.除本协议条款外，您不得使用本网站。</p>
      </div>
      <h1 style={H1Style}>IV.责任限制</h1>
      <div style={pStyle}>
        <p>
          1.本站以“原样”，“可用”和“不保证产品没有任何瑕疵或错误”为依据提供。U4SKY对用户在本网站平台发布销售的所有产品内容的实用性、
          质量、适用性、真实性、适用于特定用途、不侵权、适销性或品质不作任何声明及保证，
          也不对用户在本网站平台所发布销售的产品内容的准确性或完整性是否匹配本网站相关的规范要求，
          包括测量，重量，耐久性，强度，材料，一般物理性能，合规性，其他工程或施工属性做相关保证与承诺。
        </p>
        <p>
          2.您对计算机系统和网络造成的任何损害，由于使用本网站而造成的任何计算机系统损坏，
          包括计算机病毒造成的任何损害，均自行承担所有风险。
        </p>
        <p>
          3.即使U4SKY先前已被告知或合理地可以预见到这种损害的可能性，但是一旦发生，无论是否违反合同还是侵权行为（包括疏忽），
          U4SKY将在法律允许的最大范围内，不会对任何直接的、间接的、特殊的、偶然的、间接的惩罚性
          或示范性的损害赔偿责任（包括业务损失、收入、利润、商誉、使用、数据、电子传输的命令，或其他经济利益）。
          在任何管辖区域不允许排除或限制直接、偶然或间接损害的情况下，前述限制或排除的部分内容可能不适用，
          但应解释为在最大程度上适用于此类管辖区域。
        </p>
        <p>
          4.您同意赔偿和保留U4SKY及其子公司、关联公司、股东、高管、董事、代理人、许可人、被许可人、供应商、联盟成员其他合作伙伴、
          员工及代表免受任何索赔或要求，包括合理的律师费，由任何第三方因您使用本网站或您提交的任何资料而产生或引起的相关责任。
        </p>
      </div>
      <h1 style={H1Style}>V.终止和一般条款</h1>
      <div style={pStyle}>
        <p>
          1. 完整协议。此协议构成您与U4SKY之间的完整协议，除非您与U4SKY有其他双方同意的书面许可协议，
          如免版税许可，出版协议或其他公司许可。公司许可证有额外费用的附加保护。
          如果您的组织需要公司许可证，请联系support@u4sky.com。U4SKY不提供与本协议相关的任何其他更改，添加，变更或其他签名的表单。
          本协议的任何修改均不具有约束力，除非经授权的U4SKY代表以书面形式签署。
        </p>
        <p>
          2. 终止; 实质性违约。您违反这些条款或其他与U4SKY有关的政策或协议可能导致U4SKY终止您访问本网站，
          而U4SKY不对此负责。您可以任何时候终止本条款，停止使用本网站。您同意，任何重大违反本条款的行为将导致对U4SKY
          造成不可弥补的损害，而损害赔偿是不充分的补救措施，因此，如果发生这种违规行为，除了法律另有规定的权利和补救措施外，
          U4SKY将有权享有平衡法上的救济，包括暂时的和永久的禁令。如果U4SKY寻求此类禁令，您将放弃任何要求。
        </p>
        <p>
          3. 进出口条例。本网站可能受中国出口法律及其他国家的出口或进口法律约束。您同意严格遵守所有此类法律，特别是（a）
          获得中国要求的任何出口，再出口或进口许可; （b）不设计，开发或生产导弹，化学/生物或核武器; （c）不提供，
          重新路由或以其他方式将本网站包装在中国出口法规中明确被禁止的相关规定。
        </p>
        <p>
          4. 适用法律。该协议受深圳法律管辖，不包括法律冲突原则。由本协议产生或与本协议有关的任何诉讼或诉讼必须交由深圳前海合作区法院
          或深圳市中级人民法院提起，双方均不可撤销地服从该法院的专属管辖权。本协议下的所有通知、请求和其他通信必须是
          书面形式（电子邮件应视为书面通知）。
        </p>
        <p>
          5. 内部用户仲裁。您承认并同意，U4SKY可以自行决定仲裁本网站涉及网站或网站交易产品的用户之间的争议，
          而且这些调查结果将是最终的和不可上诉的。任何一方可以要求U4SKY对争议进行仲裁，或者U4SKY可以自行选择仲裁争议。
          为解决争议，U4SKY可能会决定终止或暂停用户，撤销许可证，提供替换该争议产品，重新建立被许可人，
          或重新分配费用（无论是通过退款，慈善捐赠或其他方式）。根据情况，U4SKY可以向任一方授予最高3倍的购买价格。
          您明白、承认、并同意接受该仲裁条款放弃司法裁决权、由陪审团审判的权利。
        </p>
        <p>
          6. 通知。根据本协议的任何通知应通过电子邮件发送至support@u4sky.com，前提是您将在5个工作日内收到U4SKY代表的确认电子邮件。
        </p>
        <p>
          7. 转让。U4SKY不会在不通知您的情况下转让本协议项下的权利，除非发生破产、兼并、收购、出售所有或几乎所有U4SKY的资产给后续
          所有者运营商的类似事件。未经U4SKY事先书面同意，您不得转载本协议下的权利，不得无理拒绝。
        </p>
        <p>
          8. 英文。本协议可能会翻译成其他语言，但中文是本协议的官方语言，中文版本与任何其他版本之间有任何冲突，将以中文版本协议为准。
          </p>
        <p>这些使用条款自2014年12月9日起生效。</p>
      </div>
    </div>
  );
};
